<?php
//------1------

$num = 0;
while($num<=100){
    if($num % 3 == 0){
        echo " " .$num;
        $num++;
        continue;
    }
    $num++;
}

//------2------

$n = 0;
echo "<hr>";
do{
    if($n  == 0){
        
        echo $n ." - ноль ";
    }
    elseif($n % 2 == 0){
        echo $n ." - четное число ";
    }
    else{
        echo $n ." - нечетное число ";
    }

    $n++;
}while($n <= 10);

//------3------

echo "<hr>";
$obl = [
    "Московская область" => ['Москва', 'Зеленоград', 'Клин'],
    "Ленинградская область" => ['Санкт-Петербург','Всеволожск','Павловск','Кронштадт'],
    "Рязанская область" => ['Рязань','Касимов','Ряжск']
];

foreach($obl as $key => $value){
    echo "$key:<br>";
    foreach($obl[$key] as $k => $v){
        $last = (count($obl[$key]) - 1);
        if([$k][0] != $last ){
            echo "$v, ";
        }
        elseif([$k][0] == $last){
            echo "$v<br>";
        }
    }
}

//------4------

function trans($str){
    $let = [
        'а'=> 'a','б'=> 'b','в'=> 'v','г'=> 'g','д'=> 'd', 'е'=> 'e', 'ё'=> 'yo', 'ж'=> 'zh',
        'з'=> 'z', 'и'=> 'i', 'й'=> 'ye', 'к'=> 'k', 'л'=> 'l', 'м'=> 'm', 'н'=> 'n', 'о'=> 'o',
        'п'=> 'p', 'р'=> 'r', 'с'=> 's', 'т'=> 't', 'у'=> 'u', 'ф'=> 'f', 'х'=> 'h', 'ц'=> 'c',
        'ч'=> 'ch', 'ш'=> 'sh', 'щ'=> 'sch', 'ы'=> 'i', 'ь'=> '\'', 'э' => 'e', 'ю'=> 'yu', 'я'=> 'ya',
    ];
    
    return strtr($str, $let);
}

echo "<hr>";
echo trans("сейчас данная строка будет отображена транслитом");

// print_r($let);

//------5------

echo "<hr>";

function change($str){
    $mas = explode(" ", $str);
    $new_str = implode("_", $mas);
    return $new_str;
}

echo change("Сейчас появятся нижние подчеркивания");

//------7------

echo "<hr>";
function vivod($a){
    echo "$a ";
}

for($i=0; $i<10; vivod($i++)){ }

//------8------

echo "<hr>";
$obl = [
    "Московская область" => ['Москва', 'Зеленоград', 'Клин'],
    "Ленинградская область" => ['Санкт-Петербург','Всеволожск','Павловск','Кронштадт'],
    "Рязанская область" => ['Рязань','Касимов','Ряжск']
];

foreach($obl as $key => $value){
    echo "$key:<br>";
    foreach($obl[$key] as $v){
        $first = mb_substr($v,0,1);
        if($first == "К"){
            echo "$v<br>";
        }     
    }
}

//------9------

echo "<hr>";

function full_transition($str){
    $let = [
        'а'=> 'a','б'=> 'b','в'=> 'v','г'=> 'g','д'=> 'd', 'е'=> 'e', 'ё'=> 'yo', 'ж'=> 'zh',
        'з'=> 'z', 'и'=> 'i', 'й'=> 'ye', 'к'=> 'k', 'л'=> 'l', 'м'=> 'm', 'н'=> 'n', 'о'=> 'o',
        'п'=> 'p', 'р'=> 'r', 'с'=> 's', 'т'=> 't', 'у'=> 'u', 'ф'=> 'f', 'х'=> 'h', 'ц'=> 'c',
        'ч'=> 'ch', 'ш'=> 'sh', 'щ'=> 'sch', 'ы'=> 'i', 'ь'=> '\'', 'э' => 'e', 'ю'=> 'yu', 'я'=> 'ya',
    ];

    $mas = explode(" ", $str);
    $new_str = implode("_", $mas);
    return strtr($new_str, $let);
}

echo full_transition("сейчас данная строка будет отображена транслитом");